app/views/projects/index.html.erb

<h1><%= pluralize(@projects.size, 'Project') %></h1>
---
SELECT "projects".* FROM "projects" WHERE (pledging_ends_on >= '2013-12-25 06:18:16.124997') ORDER BY pledging_ends_on asc