app/controllers/pledges_controller.rb

  def index
    @project = Project.find(params[:project_id])
    @pledges = @project.pledges.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pledges".* FROM "pledges" WHERE "pledges"."project_id" = ?  [["project_id", 1]]

  def new
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]