app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE (pledging_ends_on >= '2013-12-25 06:18:16.124997') ORDER BY pledging_ends_on asc
---
  def index
    @projects = Project.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = ?, "description" = ?, "website" = ?, "team_members" = ?, "image_file_name" = ?, "pledging_ends_on" = ?, "updated_at" = ? WHERE "projects"."id" = 1
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.delete